code-review/NRB_3471_3546/База_Было/Documents/ОперацииЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОперацииЦБ</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
				<xr:Item>Document.ЦБВПути</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦБДепозитарийМХ</xr:Item>
				<xr:Item>AccumulationRegister.ЗаблокированныеЦБвВышестоящемДепозитарии</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБМестоРасчетов</xr:Item>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБ</xr:Item>
				<xr:Item>AccumulationRegister.ЦБВПути</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокировочныйРазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВДепозитарииМХ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВМестеРасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеВстречный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторВстречный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпераций</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиОснования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетыНаDMA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Референс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтчетаНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/КлассыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КлассыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Административные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентарные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Глобальные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информационные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплексные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/РазделыСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РазделыСчетаДепо</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СчетаДепо</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерПоручения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийКодНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОткрытияСчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазделаСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСубклиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субклиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЗакрытияРаздела</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПоПредписаниюБР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ОперацииЦБ/Forms/ФормаДокумента/Ext/Form/Module.bsl
//////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда 
		Если Объект.Проверка Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ЗаполнитьШапкуДокументаСервер();
		
		Если Не ЗначениеЗаполнено(Объект.Инициатор) Тогда
			Если Объект.ВидОперацииД = Справочники.ВидыОпераций.Депонирование
				ИЛИ Объект.ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
				Объект.Инициатор = Справочники.Организации.ПустаяСсылка();
			Иначе
				Объект.Инициатор = Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		УстановитьНомерДокументаСервер();
	КонецЕсли;
	
	УправлениеДиалогомСервер();
	
	Если Объект.Проведен Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОформитьЭлементКомандыУправленияПризнакомОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииДПриИзменении(Элемент)
	ВидОперацииДПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДанныхДепонента(Элемент)
	ПриИзмененииДанныхДепонентаСервер(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДанныхПолучателя(Элемент)
	ПриИзмененииДанныхПолучателяСервер(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДанныхМХДепонента(Элемент)
	ПриИзмененииДанныхМХДепонентаСервер(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДанныхМХПолучателя(Элемент)
	ПриИзмененииДанныхМХПолучателяСервер(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ДокументОснованиеПриИзмененииСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	Если Объект.Количество <> 0 Тогда
		Объект.Цена = Объект.Сумма / Объект.Количество;
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Указано нулевое количество! Цена не пересчитана!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦенаКоличествоПриИзменении(Элемент)
	Объект.Сумма = Объект.Цена * Объект.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ЦБПриИзменении(Элемент)
	Котировка = ЦБКотировкаСервер();
	Если Котировка = Неопределено Тогда
		Объект.Цена	= 0;
	Иначе
		Объект.Цена	= Котировка.РыночнаяЦена;
	КонецЕсли;
	Объект.Сумма = Объект.Количество * Объект.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ЦБОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	ДатаПроверки			= ?(Объект.Ссылка.Пустая(), ТекущаяДата(), Объект.Дата);
	ЦенныеБумагиКлиент.ЦеннаяБумагаПроверкаВыборка(ВыбранноеЗначение, ДатаПроверки, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеВстречныйПриИзменении(Элемент)
	ДокументОснованиеВстречныйПриИзмененииСервер();
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ВидОперацииДПриИзмененииСервер()
	Если Объект.ВидОперацииД.КлассОпераций <> Перечисления.КлассыОпераций.Инвентарные
		И Объект.ВидОперацииД.КлассОпераций <> Перечисления.КлассыОпераций.Комплексные
		И Объект.ВидОперацииД.КлассОпераций <> Перечисления.КлассыОпераций.Глобальные
		И Объект.ВидОперацииД <> Справочники.ВидыОпераций.ПриемЦБНаОбслуживание
		И Объект.ВидОперацииД <> Справочники.ВидыОпераций.СнятиеЦБсОбслуживания Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Данная операция документом 'Операция с ЦБ' не производится!";
		Сообщение.Сообщить();
		
		Объект.ВидОперацииД = Справочники.ВидыОпераций.Депонирование;
	КонецЕсли;
	ЗаполнениеРеквизитовПоВидуОперацииСервер();
	УправлениеДиалогомСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШапкуДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ТекущийОбъект, ПараметрыСеанса.ТекущийПользователь, , );
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура УстановитьНомерДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогомСервер()
	Если Объект.ВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
		Элементы.ГруппаПолучатель.Видимость				= Истина;
		
		Элементы.Получатель.Доступность					= Истина;
		Элементы.СчетДепоПолучатель.Доступность			= Истина;
		Элементы.РазделСчетаДепоПолучатель.Доступность	= Истина;
		
		Элементы.МестоХраненияПолучатель.Доступность	= Ложь;
		Элементы.СчетДепоМХПолучатель.Доступность		= Ложь;
		Элементы.РазделСчетаДепоМХПолучатель.Доступность= Ложь;
		
		Элементы.ГруппаДепонент.Видимость				= Истина;
		Элементы.ГруппаСтраницыДокумента.Видимость		= Истина;
		
		Элементы.ГруппаВстречныеРеквизиты.Видимость		= Истина;
		Элементы.РасчетыНаDMA.Видимость					= Ложь;
		
	ИначеЕсли Объект.ВидОперацииД = Справочники.ВидыОпераций.Перемещение
		ИЛИ Объект.ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо
		ИЛИ Объект.ВидОперацииД = Справочники.ВидыОпераций.ПередачаВЗалог
		ИЛИ Объект.ВидОперацииД = Справочники.ВидыОпераций.ВозвратИзЗалога Тогда
		
		Элементы.ГруппаПолучатель.Видимость				= Истина;
		
		Элементы.Получатель.Доступность					= Ложь;
		Элементы.СчетДепоПолучатель.Доступность			= Истина;
		Элементы.РазделСчетаДепоПолучатель.Доступность	= Истина;
		
		Элементы.МестоХраненияПолучатель.Доступность	= Истина;
		Элементы.СчетДепоМХПолучатель.Доступность		= Истина;
		Элементы.РазделСчетаДепоМХПолучатель.Доступность= Истина;
		
		Элементы.ГруппаДепонент.Видимость				= Истина;
		Элементы.ГруппаСтраницыДокумента.Видимость		= Истина;
		
		Элементы.ГруппаВстречныеРеквизиты.Видимость		= Ложь;
		Элементы.РасчетыНаDMA.Видимость					= Ложь;
		
	ИначеЕсли Объект.ВидОперацииД = Справочники.ВидыОпераций.Депонирование
		ИЛИ Объект.ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
		Элементы.ГруппаПолучатель.Видимость				= Истина;
		
		Элементы.Получатель.Доступность					= Ложь;
		Элементы.СчетДепоПолучатель.Доступность			= Ложь;
		Элементы.РазделСчетаДепоПолучатель.Доступность	= Ложь;
		
		Элементы.МестоХраненияПолучатель.Доступность	= Истина;
		Элементы.СчетДепоМХПолучатель.Доступность		= Ложь;
		Элементы.РазделСчетаДепоМХПолучатель.Доступность= Ложь;
		
		Элементы.ГруппаДепонент.Видимость				= Истина;
		Элементы.ГруппаСтраницыДокумента.Видимость		= Истина;
		
		Элементы.ГруппаВстречныеРеквизиты.Видимость		= Ложь;
		Элементы.РасчетыНаDMA.Видимость					= Истина;
		
	ИначеЕсли Объект.ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание
		ИЛИ Объект.ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания Тогда
		Элементы.ГруппаПолучатель.Видимость				= Ложь;
		
		Элементы.Получатель.Доступность					= Ложь;
		Элементы.СчетДепоПолучатель.Доступность			= Ложь;
		Элементы.РазделСчетаДепоПолучатель.Доступность	= Ложь;
		
		Элементы.МестоХраненияПолучатель.Доступность	= Ложь;
		Элементы.СчетДепоМХПолучатель.Доступность		= Ложь;
		Элементы.РазделСчетаДепоМХПолучатель.Доступность= Ложь;
		
		Элементы.ГруппаДепонент.Видимость				= Ложь;
		Элементы.ГруппаСтраницыДокумента.Видимость		= Ложь;
		
		Элементы.ГруппаВстречныеРеквизиты.Видимость		= Ложь;
		Элементы.РасчетыНаDMA.Видимость					= Ложь;
		
	Иначе
		Элементы.ГруппаПолучатель.Видимость				= Ложь;
		
		Элементы.Получатель.Доступность					= Ложь;
		Элементы.СчетДепоПолучатель.Доступность			= Ложь;
		Элементы.РазделСчетаДепоПолучатель.Доступность	= Ложь;
		
		Элементы.МестоХраненияПолучатель.Доступность	= Ложь;
		Элементы.СчетДепоМХПолучатель.Доступность		= Ложь;
		Элементы.РазделСчетаДепоМХПолучатель.Доступность= Ложь;
		
		Элементы.ГруппаДепонент.Видимость				= Истина;
		Элементы.ГруппаСтраницыДокумента.Видимость		= Истина;
		
		Элементы.ГруппаВстречныеРеквизиты.Видимость		= Ложь;
		Элементы.РасчетыНаDMA.Видимость					= Ложь;
	КонецЕсли;
	
	Если Объект.ВидОперацииД.КлассОпераций = Перечисления.КлассыОпераций.Инвентарные Тогда
		Элементы.ГруппаИнвентарныеРеквизиты.Видимость = Истина;
	Иначе
		Элементы.ГруппаИнвентарныеРеквизиты.Видимость = Ложь;
		
		Объект.Залогодержатель	= Справочники.Контрагенты.ПустаяСсылка();
		Объект.ДатаСделки		= Дата(1,1,1);
		Объект.Референс			= "";
	КонецЕсли;
	
	Элементы.ДополнительныеДатыИсполнения.Видимость = Ложь;
	Если Объект.ВидОперацииД.ДвижениеПоЦБ Тогда
		Элементы.ДополнительныеДатыИсполнения.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеРеквизитовПоВидуОперацииСервер() Экспорт
	Если Объект.ВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
		Объект.МестоХраненияПолучатель 		= Объект.МестоХранения;
		Объект.СчетДепоМХПолучатель			= Объект.СчетДепоМХ;
		Объект.РазделСчетаДепоМХПолучатель	= Объект.РазделСчетаДепоМХ;
		
		// Дозаполняем данные для поручений на перевод ЦБ
		Объект.Получатель					= Объект.ДокументОснование.Контрагент;
		Объект.СчетДепоПолучатель			= Объект.ДокументОснование.СчетДепоКонтрагента;
		Объект.РазделСчетаДепоПолучатель	= Объект.ДокументОснование.РазделСчетаДепоКонтрагента;
		
	ИначеЕсли Объект.ВидОперацииД = Справочники.ВидыОпераций.Перемещение
				ИЛИ Объект.ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
		Объект.Получатель					= Объект.Инициатор;
		Объект.СчетДепоПолучатель			= Объект.СчетДепо;
		Объект.РазделСчетаДепоПолучатель	= Объект.РазделСчетаДепо;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииСервер()
	ТекущийОбъект	= РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.Заполнить(Объект.ДокументОснование);
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Функция ЦБКотировкаСервер()
	Котировка = РегистрыСведений.Котировки.СрезПоследних(ТекущаяДата(), Новый Структура("ЦеннаяБумага, Биржа, РежимТоргов", Объект.ЦБ, Справочники.Биржи.MICEX, Справочники.РежимыТоргов.Рыночный));
	Если Котировка.Количество()>0 Тогда
		Возврат Котировка[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановитьСвязьПараметровВыбора(ИмяЭлемента, ИмяСвязующегоЭлемента)
	НоваяСвязь	= Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект."+ИмяСвязующегоЭлемента);
	НовыйМассив	= Новый Массив;
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи	= Новый ФиксированныйМассив(НовыйМассив);
	Элементы[ИмяЭлемента].СвязиПараметровВыбора	= НовыеСвязи;
КонецПроцедуры

&НаСервере
Процедура УдалитьСвязьПараметровВыбора(ИмяЭлемента)
	НовыеСвязи	= Новый ФиксированныйМассив(Новый Массив);
	Элементы[ИмяЭлемента].СвязиПараметровВыбора	= НовыеСвязи;
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДанныхДепонентаСервер(ИмяЭлемента)
	Если ИмяЭлемента = "Депонент" Тогда
		Если НЕ Объект.Депонент.Пустая() Тогда
			УстановитьСвязьПараметровВыбора("СчетДепо", "Депонент");
		Иначе
			УдалитьСвязьПараметровВыбора("СчетДепо");
		КонецЕсли;
		Если Объект.СчетДепо.Владелец <> Объект.Депонент Тогда
			Объект.СчетДепо = Справочники.СчетаДепо.ПустаяСсылка();
		КонецЕсли;
		Если Объект.РазделСчетаДепо.Владелец <> Объект.СчетДепо Тогда
			Объект.РазделСчетаДепо = Справочники.РазделыСчетаДепо.ПустаяСсылка();
		КонецЕсли;
		
		Если Объект.ВидОперацииД = Справочники.ВидыОпераций.Перемещение
				ИЛИ Объект.ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
			Объект.Получатель = Объект.Депонент;
			ПриИзмененииДанныхПолучателяСервер("Получатель");
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "СчетДепо" Тогда
		Если Не Объект.СчетДепо.Пустая() Тогда
			УстановитьСвязьПараметровВыбора("РазделСчетаДепо", "СчетДепо");
		Иначе	
			УдалитьСвязьПараметровВыбора("РазделСчетаДепо");
		КонецЕсли;
		Если Объект.СчетДепо.Владелец <> Объект.Депонент И НЕ Объект.СчетДепо.Пустая() Тогда
			Объект.Депонент	= Объект.СчетДепо.Владелец;
		КонецЕсли;
		Если Объект.РазделСчетаДепо.Владелец <> Объект.СчетДепо Тогда
			Объект.РазделСчетаДепо	= Справочники.РазделыСчетаДепо.ПустаяСсылка();
		КонецЕсли;
		
		Если Объект.ВидОперацииД = Справочники.ВидыОпераций.Перемещение
				ИЛИ Объект.ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
			Объект.СчетДепоПолучатель = Объект.СчетДепо;
			ПриИзмененииДанныхПолучателяСервер("СчетДепоПолучатель");
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "РазделСчетаДепо" Тогда
		Если Объект.РазделСчетаДепо.Владелец <> Объект.СчетДепо И НЕ Объект.РазделСчетаДепо.Пустая() Тогда
			Объект.СчетДепо	= Объект.РазделСчетаДепо.Владелец;
		КонецЕсли;
		Если Объект.СчетДепо.Владелец <> Объект.Депонент И Не Объект.СчетДепо.Пустая() Тогда
			Объект.Депонент	= Объект.СчетДепо.Владелец;
		КонецЕсли;
		
		Если Объект.ВидОперацииД = Справочники.ВидыОпераций.Перемещение
				ИЛИ Объект.ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
			Объект.РазделСчетаДепоПолучатель = Объект.РазделСчетаДепо;
			ПриИзмененииДанныхПолучателяСервер("РазделСчетаДепоПолучатель");
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Инициатор.Пустая() Тогда
		Объект.Инициатор = Объект.СчетДепо.Владелец;
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДанныхМХДепонентаСервер(ИмяЭлемента)
	Если ИмяЭлемента = "МестоХранения" Тогда
		Если НЕ Объект.МестоХранения.Пустая() Тогда
			УстановитьСвязьПараметровВыбора("СчетДепоМХ", "МестоХранения");
		Иначе
			УдалитьСвязьПараметровВыбора("СчетДепоМХ");
		КонецЕсли;
		Если Объект.СчетДепоМХ.Владелец <> Объект.МестоХранения Тогда
			Объект.СчетДепоМХ = Справочники.СчетаДепоМХ.ПустаяСсылка();
		КонецЕсли;
		Если Объект.РазделСчетаДепоМХ.Владелец <> Объект.СчетДепоМХ Тогда
			Объект.РазделСчетаДепоМХ = Справочники.РазделыСчетаДепоМХ.ПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "СчетДепоМХ" Тогда
		Если НЕ Объект.СчетДепоМХ.Пустая() Тогда
			УстановитьСвязьПараметровВыбора("РазделСчетаДепоМХ", "СчетДепоМХ");
		Иначе	
			УдалитьСвязьПараметровВыбора("РазделСчетаДепоМХ");
		КонецЕсли;
		Если Объект.СчетДепоМХ.Владелец <> Объект.МестоХранения И НЕ Объект.СчетДепоМХ.Пустая() Тогда
			Объект.МестоХранения = Объект.СчетДепоМХ.Владелец;
		КонецЕсли;
		Если Объект.РазделСчетаДепоМХ.Владелец <> Объект.СчетДепоМХ Тогда
			Объект.РазделСчетаДепоМХ = Справочники.РазделыСчетаДепоМХ.ПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "РазделСчетаДепоМХ" Тогда
		Если Объект.РазделСчетаДепоМХ.Владелец <> Объект.СчетДепоМХ И НЕ Объект.РазделСчетаДепоМХ.Пустая() Тогда
			Объект.СчетДепоМХ = Объект.РазделСчетаДепоМХ.Владелец;
		КонецЕсли;
		Если Объект.СчетДепоМХ.Владелец <> Объект.МестоХранения И НЕ Объект.СчетДепоМХ.Пустая() Тогда
			Объект.МестоХранения = Объект.СчетДепоМХ.Владелец;
		КонецЕсли;
	КонецЕсли;
	
	// Для операций перевода переносим данные из МХ по депоненту в получатели
	Если Объект.ВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
        Объект.МестоХраненияПолучатель		= Объект.МестоХранения;
		Объект.СчетДепоМХПолучатель			= Объект.СчетДепоМХ;
		Объект.РазделСчетаДепоМХПолучатель	= Объект.РазделСчетаДепоМХ;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДанныхПолучателяСервер(ИмяЭлемента)
	Если ИмяЭлемента = "Получатель" Тогда
		Если Не Объект.Получатель.Пустая() Тогда
			УстановитьСвязьПараметровВыбора("СчетДепоПолучатель", "Получатель");
		Иначе
			УдалитьСвязьПараметровВыбора("СчетДепоПолучатель");
		КонецЕсли;
		Если Объект.СчетДепоПолучатель.Владелец <> Объект.Получатель Тогда
			Объект.СчетДепоПолучатель = Справочники.СчетаДепо.ПустаяСсылка();
		КонецЕсли;
		Если Объект.РазделСчетаДепоПолучатель.Владелец <> Объект.СчетДепоПолучатель Тогда
			Объект.РазделСчетаДепоПолучатель = Справочники.РазделыСчетаДепо.ПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "СчетДепоПолучатель" Тогда
		Если Не Объект.СчетДепоПолучатель.Пустая() Тогда
			УстановитьСвязьПараметровВыбора("РазделСчетаДепоПолучатель", "СчетДепоПолучатель");
		Иначе	
			УдалитьСвязьПараметровВыбора("РазделСчетаДепоПолучатель");
		КонецЕсли;
		Если Объект.СчетДепоПолучатель.Владелец <> Объект.Получатель И НЕ Объект.СчетДепоПолучатель.Пустая() Тогда
			Объект.Получатель = Объект.СчетДепоПолучатель.Владелец;
		КонецЕсли;
		Если Объект.РазделСчетаДепоПолучатель.Владелец <> Объект.СчетДепоПолучатель Тогда
			Объект.РазделСчетаДепоПолучатель = Справочники.РазделыСчетаДепо.ПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "РазделСчетаДепоПолучатель" Тогда
		Если Объект.РазделСчетаДепоПолучатель.Владелец <> Объект.СчетДепоПолучатель
			И НЕ Объект.РазделСчетаДепоПолучатель.Пустая() Тогда
			Объект.СчетДепоПолучатель = Объект.РазделСчетаДепоПолучатель.Владелец;
		КонецЕсли;
		Если Объект.СчетДепоПолучатель.Владелец <> Объект.Получатель И НЕ Объект.СчетДепоПолучатель.Пустая() Тогда
			Объект.Получатель = Объект.СчетДепоПолучатель.Владелец;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДанныхМХПолучателяСервер(ИмяЭлемента)
	Если ИмяЭлемента = "МестоХраненияПолучатель" Тогда
		Если  Не Объект.МестоХраненияПолучатель.Пустая() Тогда
			УстановитьСвязьПараметровВыбора("СчетДепоМХПолучатель", "МестоХраненияПолучатель");
		Иначе
			УдалитьСвязьПараметровВыбора("СчетДепоМХПолучатель");
		КонецЕсли;
		Если Объект.СчетДепоМХПолучатель.Владелец <> Объект.МестоХраненияПолучатель Тогда
			Объект.СчетДепоМХПолучатель	= Справочники.СчетаДепоМХ.ПустаяСсылка();
		КонецЕсли;
		Если Объект.РазделСчетаДепоМХПолучатель.Владелец <> Объект.СчетДепоМХПолучатель Тогда
			Объект.РазделСчетаДепоМХПолучатель	= Справочники.РазделыСчетаДепоМХ.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ИмяЭлемента = "СчетДепоМХПолучатель" Тогда
		Если  Не Объект.СчетДепоМХПолучатель.Пустая() Тогда
			УстановитьСвязьПараметровВыбора("РазделСчетаДепоМХПолучатель", "СчетДепоМХПолучатель");
		Иначе	
			УдалитьСвязьПараметровВыбора("РазделСчетаДепоМХПолучатель");
		КонецЕсли;
		Если Объект.СчетДепоМХПолучатель.Владелец <> Объект.МестоХраненияПолучатель И Не Объект.СчетДепоМХПолучатель.Пустая() Тогда
			Объект.МестоХраненияПолучатель	= Объект.СчетДепоМХПолучатель.Владелец;
		КонецЕсли;
		Если Объект.РазделСчетаДепоМХПолучатель.Владелец <> Объект.СчетДепоМХПолучатель Тогда
			Объект.РазделСчетаДепоМХПолучатель	= Справочники.РазделыСчетаДепоМХ.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ИмяЭлемента = "РазделСчетаДепоМХПолучатель" Тогда
		Если Объект.РазделСчетаДепоМХПолучатель.Владелец <> Объект.СчетДепоМХПолучатель И Не Объект.РазделСчетаДепоМХПолучатель.Пустая() Тогда
			Объект.СчетДепоМХПолучатель	= Объект.РазделСчетаДепоМХПолучатель.Владелец;
		КонецЕсли;
		Если Объект.СчетДепоМХПолучатель.Владелец <> Объект.МестоХраненияПолучатель И Не Объект.СчетДепоМХПолучатель.Пустая() Тогда
			Объект.МестоХраненияПолучатель	= Объект.СчетДепоМХПолучатель.Владелец;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПризнакИсключенияИзОбмена(Команда)
	Объект.ИсключитьИзОбменаДанными = НЕ Объект.ИсключитьИзОбменаДанными;
	ОформитьЭлементКомандыУправленияПризнакомОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЭлементКомандыУправленияПризнакомОбмена()
	Элементы.КомандаУправленияПризнакомОбмена.Пометка = Объект.ИсключитьИзОбменаДанными;
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеВстречныйПриИзмененииСервер()
	Объект.ИнициаторВстречный = Объект.ДокументОснованиеВстречный.Инициатор;
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеВстречныйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("ВидОперацииД", Объект.ВидОперацииД);
	мПараметры = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Документ.Поручение.ФормаВыбора", мПараметры, Элементы.ДокументОснованиеВстречный);
КонецПроцедуры
